# DataFrame Operations
DataFrame İşlemleri:
* DataFrame Oluşturma
* DataFrame Veri Filtreleme
* Veri Okuma Yöntemleri
* Veri Yazma Yöntemleri

In [1]:
# Pandas kütüphanesini import edelim

import pandas as pd

###  DataFrame Oluşturma

In [2]:
#Boş DataFrame oluşturma

df_empty = pd.DataFrame()
df_empty

Empty DataFrame
Columns: []
Index: []

In [3]:
# Dictionary nesnesi ile DataFrame oluşturma

d={
    'Model':["m1","m2","m3"], 
    'Seri':["s1","s2","s3"], 
    'Yil':[2001,2002,2003], 
    'Fiyat':[1000.00,2000.00,3000.00]
    }

df=pd.DataFrame(d)
df

  Model Seri   Yil   Fiyat
0    m1   s1  2001  1000.0
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

### DataFrame Veri Filtreleme

In [4]:
# Tek bir sütun 

df.Model # Alan ismi tek kelime ise doğrudan yazılabilir, değilse df["Model"] şeklinde yazılmalıdır.

0    m1
1    m2
2    m3
Name: Model, dtype: object

In [5]:
df["Seri"]

0    s1
1    s2
2    s3
Name: Seri, dtype: object

In [6]:
# Birden fazla sütun

df[["Yil", "Fiyat"]] # ! Çift parantez [[ ]] kullanıldığına dikkat edin

    Yil   Fiyat
0  2001  1000.0
1  2002  2000.0
2  2003  3000.0

In [7]:
# 2002 ve yukarı yılları filtrele
df[df["Yil"]>=2002]

  Model Seri   Yil   Fiyat
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

In [8]:
# Fiyat alanı boş olan satırlar
df[df["Fiyat"].isnull()]

Empty DataFrame
Columns: [Model, Seri, Yil, Fiyat]
Index: []

In [9]:
# Fiyat alanı dolu olan satırlar
df[df["Fiyat"].notnull()]

  Model Seri   Yil   Fiyat
0    m1   s1  2001  1000.0
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

##### **iloc** kullanımı

In [10]:
df.iloc[0]  # 0. satırı ver

Model        m1
Seri         s1
Yil        2001
Fiyat    1000.0
Name: 0, dtype: object

In [11]:
df.iloc[1:3]  # iloc[m:n] m. satırdan başlayarak n. satıra kadar olanları ver (n dahil değil)

  Model Seri   Yil   Fiyat
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

In [12]:
df.iloc[:2]  # ilk 2 satır

  Model Seri   Yil   Fiyat
0    m1   s1  2001  1000.0
1    m2   s2  2002  2000.0

In [13]:
df.iloc[2:] # 2. ve sonrası satırlar

  Model Seri   Yil   Fiyat
2    m3   s3  2003  3000.0

In [14]:
df.iloc[-2:] # son 2 satır

  Model Seri   Yil   Fiyat
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

In [15]:
df.iloc[:] # tüm satırlar

  Model Seri   Yil   Fiyat
0    m1   s1  2001  1000.0
1    m2   s2  2002  2000.0
2    m3   s3  2003  3000.0

In [16]:
df.iloc[:, 2] # 2. index sütununun tüm satırları

0    2001
1    2002
2    2003
Name: Yil, dtype: int64

### DataFrame'den Alan Silme

In [17]:
# Tek bir alan silme
del df["Model"]
df

  Seri   Yil   Fiyat
0   s1  2001  1000.0
1   s2  2002  2000.0
2   s3  2003  3000.0

In [18]:
# Birden fazla alan silme
df.drop(["Yil", "Fiyat"], axis=1, inplace=True)
df

  Seri
0   s1
1   s2
2   s3

### Veri Okuma Yöntemleri

In [19]:
#CSV dosyasından veri okuma

data = pd.read_csv("test_pandas.csv", header=None) # dosyadaki ilk satır başlık içermiyorsa header=None kullanılır
data

   0  1     2    3
0  0  1   cat  1.1
1  1  2   dog  2.2
2  2  3  bird  3.3

In [20]:
#Excel dosyasından veri okuma

data = pd.read_excel('test_pandas.xlsx')
data

   Unnamed: 0  Column A Column B  Column C
0           0         1      cat       1.1
1           1         2      dog       2.2
2           2         3     bird       3.3

In [21]:
# Yukarıda Unnamed: 0 alanı Excel dosyasında index alanı olduğu için bu sütun index olarak kullanılabilir

data.set_index("Unnamed: 0", inplace=True)  
data

            Column A Column B  Column C
Unnamed: 0
0                  1      cat       1.1
1                  2      dog       2.2
2                  3     bird       3.3

**! İpucu:** <font color="red">inplace=True</font> parametresi ile yapılan değişiklik orjinal DataFrame üzerinde güncellenir

In [22]:
#read_clipboard() komutunun çalışabilmesi için aşağıdaki listeyi kopyalayın (CTRL + C)
"""
0	1	cat	1.1
1	2	dog	2.2
2	3	bird	3.3
"""
#Clipborad (hafızaya kopyalanan tablo yapısındaki metinden) okuma

data = pd.read_clipboard(header=None) #İlk satırı başlık olarak alma
data

   0  1     2    3
0  0  1   cat  1.1
1  1  2   dog  2.2
2  2  3  bird  3.3

In [23]:
#Html adresinden bir tablo okuma, verilen adresteki [2]. tabloyu oku

df=pd.read_html("https://en.wikipedia.org/wiki/List_of_countries_by_GDP_(nominal)")[2]
df.iloc[:5]

  Country/Territory IMF[1][13]            World Bank[14]             \
  Country/Territory   Forecast       Year       Estimate       Year
0             World  109529216       2024      105435540       2023
1     United States   28781083       2024       27360935       2023
2             China   18532633  [n 1]2024       17794782  [n 3]2023
3           Germany    4591100       2024        4456081       2023
4             Japan    4110452       2024        4212945       2023

  United Nations[15]
            Estimate       Year
0          100834796       2022
1           25744100       2022
2           17963170  [n 1]2022
3            4076923       2022
4            4232173       2022

In [24]:
# Veri tabanından veri okuma

import sqlite3
conn = sqlite3.connect('test_pandas.db') #Veri tabanına bağlan, yoksa oluştur
sql = "SELECT * FROM test"  # SQL Kodu detayları için SQL komutları konusunu araştırın!
data = pd.read_sql(sql, conn)
data

    id           city    mascot
0    1  San Francisco     49ers
1    2        Oakland   Raiders
2    3        Seattle  Seahawks
3    4        Chicago     Bears
4    5            NYC      Jets
..  ..            ...       ...
83   7            ANA  Chargers
84   6             LA      Rams
85   7            ANA  Chargers
86   6             LA      Rams
87   7            ANA  Chargers

[88 rows x 3 columns]

**Diğer veri okuma yöntemleri:**
* pd.read_json()   : JSON dosyasından veri oku
* pd.read_xml()    : XML dosyasından veri oku
* pd.read_pickle() : Pickle dosyasından veri oku
* ...

Örnekleri çoğaltmak mümkün.

### Veri Yazma Yöntemleri

In [25]:
# Veri tabanındaki tabloya verileri yaz

data.to_sql('test', conn, if_exists='append', index=False) # test tablosuna yaz, bu tablo yoksa oluştur, varsa üzerine ekle

88

In [26]:
#CSV dosyasına veri yazma
data.to_csv("yeni_dosya.csv", index=False) # index=False kodu ile yazarken indeksleri yazma

In [27]:
#Excel dosyasına veri yazma
data.to_excel("yeni_dosya.xlsx", index=False)

### Son Söz

Bu projede Pandas kütüphanesine ait temel DataFrame işlemlerine dair örnekler sunduk. Bu işlemler şunlardır:
* Boş veya dictionary nesnesi kullanarak birer DataFrame oluşturduk
* DataFrame verilerinde satır ve sütun filtreleme yaptık
* Çeşitli ortamlardan veri okuyarak DataFrame oluşturduk
* DataFrame verilerini çeşitli ortamlara (csv, excel) aktardık.